import React from 'react'

import informationIcon from '../assets/images/information.svg'

const Covid = () => {
    const data = [
         {
            "p":"Повідомляємо та гарантуємо виконання таких заходів безпеки з метою профілактики та виявлення COVID-19 в учасників та працівників Табору"
         },
         {
            "p":"Скасування будь-яких виїздів за межі території готелю."
         },
         {
            "p":"Заборона працівникам Табору та персоналу готелю покидати територію та контактувати з іншими людьми впродовж одного заїзду"
         },
         {
            "p":"Щоденний температурний скринінг усіх учасників табору"
         },
         {
            "p":"Дотримання усіх санітарних норм щодо термічної обробки посуду та  їжі"
         },
         {
            "p":"Щогодинна дезінфекція місць найбільшого скупчення учасників Табору"
         },
         {
            "p": "Щоденна дезінфекція кімнат"
         },
         {
            "p": "Наявність антисептиків, мила у кожному номері та засобів індивідуального захисту за необхідності"
         },
         {
            "p":"Заборона на відвідування дітей у Таборі"
         }

// знизу якщо можна ці 8 пунктів зробити з такими інфографічними іконками  --

    ]
    return (
        <div className="information-block">
            {
                data.map((item, index)=>{
                    return (
                        <div key={index} style={{display: `flex`, marginBottom: `20px`}}>
                            <div className="inform-icon">
                                <img src={informationIcon} width="100%" alt="inform-icon"/>
                            </div>
                            <p style={{ textAlign: `left`, marginLeft: `20px`, lineHeight: `normal`, width: `100%`, display: `block`}}>{item.p}</p>
                        </div>
                    )
                })
            }
        </div>
    )
}

export default Covid
